{
    "type": "FeatureCollection",
    "features": [
        {
            "type": "Feature",
            "geometry": {
                "type": "Point",
                "coordinates": [-81.547383, 35.89855]
            },
            "properties": {
                "city": "Lenoir, North Carolina",
                "description": "One of the reasons Google chose the city of Lenoir, North Carolina is its roots as a factory town in the furniture industry. Since furniture mills used a lot of power, we were able to reuse much of the existing power infrastructure. Lenoir is now home to the Internet, but also to our data center employees. Because of this, we've awarded more than $350,000 in grants and provided over $2M in free advertising to local nonprofits. We've also invested in several green initiatives, including a project to turn hog waste into renewable energy.",
                "image": "img/lenoir.jpg",
                "img-source": "http://www.google.ca/about/datacenters/gallery/index.html#/locations/lenoir/4",
                "type": "datacenter"
            }
        },
        {
            "type": "Feature",
            "geometry": {
                "type": "Point",
                "coordinates": [-80.03767, 33.073824]
            },
            "properties": {
                "city": "Berkeley County, South Carolina",
                "description": "Here in Berkeley County, we’ve tried to give back more than jobs to the community. We’ve made an investment of over half a million dollars to local schools and nonprofits and introduced free Wi-Fi to downtown Goose Creek. In June 2012, we hosted Googlefest in nearby Charleston to help nonprofits, small businesses, and educators use the full range of Google’s tools.",
                "image": "img/berkeley.jpg",
                "img-source": "http://www.google.ca/about/datacenters/gallery/index.html#/locations/berkeley-county/2",
                "type": "datacenter"
            }
        },
        {
            "type": "Feature",
            "geometry": {
                "type": "Point",
                "coordinates": [-84.584814, 33.749733]
            },
            "properties": {
                "city": "Douglas County, Georgia",
                "description": "Google has been working for years to optimize our data center designs in order to minimize our environmental footprint. A good example is at our Douglas County, Georgia facility where we built a water processing facility and treatment plant in order to make sure our water usage didn’t take fresh water away from the local community.",
                "image": "img/douglas-county.jpg",
                "img-source": "http://www.google.ca/about/datacenters/gallery/index.html#/locations/douglas-county/3",
                "type": "datacenter"
            }
        },
        {
            "type": "Feature",
            "geometry": {
                "type": "Point",
                "coordinates": [-95.330061, 36.241139]
            },
            "properties": {
                "city": "Mayes County, Oklahoma",
                "description": "At our data center in Pryor, Oklahoma, we've built strong ties with the Cherokee community. We've created over 100 jobs and awarded grants to local schools to help them upgrade their equipment so students can stay ahead of the curve.",
                "image": "img/mayes-county.jpg",
                "img-source": "http://www.google.ca/about/datacenters/gallery/index.html#/locations/mayes-county/2",
                "type": "datacenter"
            }
        },
        {
            "type": "Feature",
            "geometry": {
                "type": "Point",
                "coordinates": [-95.863867, 41.221583]
            },
            "properties": {
                "city": "Council Bluffs, Iowa",
                "description": "We're always looking to improve the way we run our data centers by pursuing innovation in efficiency and quality control. Here in Council Bluffs, Iowa, we found a way to use renewable energy by purchasing power from a nearby wind farm. This helps support local green initiatives as well as shrink our footprint overall.",
                "image": "img/council-bluffs.jpg",
                "img-source": "http://www.google.ca/about/datacenters/gallery/index.html#/locations/council-bluffs/2",
                "type": "datacenter"
            }
        },
        {
            "type": "Feature",
            "geometry": {
                "type": "Point",
                "coordinates": [-121.202267, 45.632511]
            },
            "properties": {
                "city": "The Dalles, Oregon",
                "description": "Here among Oregon’s rolling hills, snow-capped peaks and brisk Columbia River, we make Google products and services available to the entire world. The Dalles data center location was chosen for its mild climate and access to hydroelectric power. Our staff has continued this green thinking by starting a community garden on one corner of the site.",
                "image": "img/the-dalles.jpg",
                "img-source": "http://www.google.ca/about/datacenters/gallery/index.html#/locations/the-dalles/7",
                "type": "datacenter"
            }
        },
        {
            "type": "Feature",
            "geometry": {
                "type": "Point",
                "coordinates": [-71.059484, -34.452218]
            },
            "properties": {
                "city": "Quilicura, Chile",
                "intro": "Google&#39;s datacenter in Quilicura will be its <a href='http://www.google.ca/about/datacenters/inside/locations/quilicura/'>first</a> in Latin America.  The city was chosen over other bigger latin american cities <a href='http://techcrunch.com/2012/09/07/google-chooses-chile-for-its-first-latin-american-data-center/'>due</a> to its skilled workforce and the Chilean goverments focus on start-ups and technology.",
                "climate": "Due to its length, Chile has a varied climate.  From temperate desert in the north, to Mediterranean in the centre, and cool and damp in the south.  Quilicura is located in the south of Chile where it is cooler.  While <a href='http://www.preventionweb.net/english/countries/statistics/?cid=35'>most</a> of Chile&#39;s natural disasters have been floods, it is also at a <a href='http://earthquake.usgs.gov/earthquakes/world/chile/gshap.php'>fairly high</a> of earthquakes.",
                "energy": "Historically, hydro-electric dams have provided the bulk of Chile&#39;s power.  Recently however, droughts have caused blackouts and outages so the goverment has started diversifying into natural-gas-fired power plants. The Ralco plant situated on the Biobio River is the largest hydro dam in the region and provides 570 MW of power.",
                "government": "Chile has a <a href='http://www.google.ca/about/datacenters/inside/locations/quilicura/'>skilled workforce</a> and a  progressive government with a commitment to transparent and business friendly regulations.",
                "economy": "In South American countries, Chile has the <a href='http://www.heritage.org/index/country/chile'>highest</a> degree of economic freedom and was the region&#39;s <a href='http://www.oecd.org/chile/chilesaccessiontotheoecd.htm'>first</a> country to join the OECD.",
                "image": "img/douglas-county2.jpg",
                "img-source": "http://www.google.ca/about/datacenters/gallery/index.html#/locations/douglas-county/5",
                "type": "datacenter"
            }
        },
        {
            "type": "Feature",
            "geometry": {
                "type": "Point",
                "coordinates": [3.8547128, 50.4750956]
            },
            "properties": {
                "city": "St. Ghislain, Belgium",
                "intro": "Google&#39;s datacenter in mainland Belgium, is situated in the small town of St. Ghislain.  It is considered to be one if Google&#39;s most efficient data centers as it was built next to an industrial canal in order for it to use the water to cool its servers.",
                "climate": "Part of mainland Europe, St. Ghislain <a href='https://www.cia.gov/library/publications/the-world-factbook/geos/be.html'>enjoys</a> mild winters and cool summers.  Belgium suffers <a href='http://www.preventionweb.net/english/countries/statistics/?cid=17'>relatively few</a> natural disasters, the most common being storms and flooding, and has a <a href='http://earthquake.usgs.gov/earthquakes/world/belgium/gshap.php'>low</a> risk of earthquakes.",
                "energy": "Google&#39;s data center in St. Ghislain is considered to be one its most efficient.  This is due to the fact that they built the facility to run without the use of <a href='http://www.datacenterknowledge.com/archives/2013/04/10/google-invests-300m-euros-to-expand-mega-efficient-belgium-facility/'>chillers</a>, refridgerators used to chill water to cool the servers.  The facility is “<a href='http://www.datacenterknowledge.com/archives/2013/04/10/google-invests-300m-euros-to-expand-mega-efficient-belgium-facility/'>water self-sufficient</a>,” as it is draws water from a nearby industrial canal and has built a 20,000-square-foot water treatment plant  to prepare the canal water for use in the data center.",
                "government": "Belgium boasts a stable and democratic government, low crime rates, and one of the highest post-secondary education levels in the <a href='http://www3.weforum.org/docs/WEF_GlobalCompetitivenessReport_2013-14.pdf'>world</a>.",
                "economy": "Belgium has a modern, open, and private-enterprise-based economy.  It has <a href='https://www.cia.gov/library/publications/the-world-factbook/geos/be.html'>taken advantage</a> of its central geographic location, highly developed transport network, and diversified industrial and commercial base.",
                "image": "img/st-ghislain.jpg",
                "img-source": "http://www.google.ca/about/datacenters/gallery/index.html#/locations/st-ghislain/3",
                "type": "datacenter"
            }
        },
        {
            "type": "Feature",
            "geometry": {
                "type": "Point",
                "coordinates": [-6.44206299999999, 53.320108]
            },
            "properties": {
                "city": "Dublin, Ireland",
                "intro": "Google&#39;s datacenter in west Dublin is its second installation in Ireland.  In addition to its European Headquarters, the datacenter boasts an advanced air-cooling system that takes advantage of Ireland’s weather to keep its servers running smoothly.",
                "climate": "Due to its location off the coast of the United Kingdom and being right on the Atlantic Ocean, Ireland has a <a href='https://www.cia.gov/library/publications/the-world-factbook/geos/ei.html'>temperate maritime</a> climate with mild winters and cool summers that are consistently humid.  In addition, Ireland has very few natural disasters <a href='http://earthquake.usgs.gov/earthquakes/world/ireland/gshap.php'>very low</a> chance of earthquakes.",
                "energy": "Google&#39;s Dublin datacenter is also considered to be one of its most efficient.  Google has <a href='http://www.google.ca/about/datacenters/inside/locations/dublin/'>drastically</a> reduced its cooling costs by using the cool sea air blowing in off the coast to chill its servers.",
                "government": "In the past, Ireland has had its fair share of internal political tensions. More recently however, tensions have simmered and now enjoys a fairly stable democracy.  In addition it is highly educated and 40% of the population resides within 100 km of Dublin.",
                "economy": "Ireland is a small, modern, trade-dependent econom and today <a href='https://www.cia.gov/library/publications/the-world-factbook/rankorder/2004rank.html?countryName=Ireland&amp;countryCode=ei&amp;regionCode=eur&amp;rank=27#ei'>ranks</a> amongst the wealthiest countries in the world in terms of GDP per capita.  Thanks to <a href='http://www.datacenterknowledge.com/archives/2013/04/08/dublin-free-cooling/'>large investements</a> from multi-national corporations (such as Google, Microsoft and Amazon all building datacenters on the isle), Ireland has pulled itself out of its 2008 recession.",
                "image": "img/council-bluffs2.jpg",
                "img-source": "http://www.google.ca/about/datacenters/gallery/index.html#/locations/council-bluffs/4",
                "type": "datacenter"
            }
        },
        {
            "type": "Feature",
            "geometry": {
                "type": "Point",
                "coordinates": [27.11700300000001, 60.536578]
            },
            "properties": {
                "city": "Hamina, Finland",
                "intro": "Google&#39;s data center in Finland was built inside an old paper mill situated just outside the small town of Hamina, on the coast of the Baltic Sea.  One of the unique features of the site is that raw sea water is piped through the an existing tunnel to cool all of the servers naturally.  The location was chosen for a variety of other reasons.",
                "climate": "As it is in the Arctic Circle, Finland has a cold temperate <a href='https://www.cia.gov/library/publications/the-world-factbook/geos/fi.html'>climate</a> that is potentially subarctic but comparatively mild because of moderating influence of the North Atlantic Current, Baltic Sea, and more than 60,000 lakes.  In addtion, in the past 30 years, Finland has <a href='http://www.preventionweb.net/english/countries/statistics/?cid=61'>very rarely</a> suffered any natural disasters and has a <a href='http://earthquake.usgs.gov/earthquakes/world/finland/gshap.php'>very low</a> risk of earthquakes.",
                "energy": "The Hamina data center is one of the most enery efficient data centers in the world.  In January 2014, Google <a href='http://www.datacenterknowledge.com/archives/2014/01/23/google-buys-swedish-wind-power-finnish-data-center/'>announced</a> that it had bought the entire electricity output of 4 new wind farms being built in Sweden.  This is the second wind farm energy deal in Sweden that Google has annouced.  In 2013 it <a href='http://www.datacenterknowledge.com/archives/2013/06/04/googles-powering-finnish-data-center-with-swedish-wind-farm/'>bought</a> the ten-year output of a new wind farm in Ramsnäs in order to offset the carbon costs of running its data center.  The moved helped cement Google&#39;s green energy claims while at the same time protecting it from future increases in energy prices.",
                "government": "Finland boasts a stable and democratic government, low crime rates, and one of the highest post-secondary education levels in the <a href='http://www3.weforum.org/docs/WEF_GlobalCompetitivenessReport_2013-14.pdf'>world</a>.",
                "economy": "A highly industrialized, largely free-market economy with a lively technology export market.",
                "image": "img/hamina.jpg",
                "img-source": "http://www.google.ca/about/datacenters/gallery/index.html#/locations/hamina/6",
                "type": "datacenter"
            }
        },
        {
            "type": "Feature",
            "geometry": {
                "type": "Point",
                "coordinates": [120.46589799999998, 23.991936]
            },
            "properties": {
                "city": "Changhua County, Taiwan",
                "description": "Taiwan is a leading high-tech hub, with a history of supporting innovation and foreign investment, and a location right in the heart of Asia. To power its high-tech industry and thriving Internet economy, Taiwan has invested in reliable infrastructure, innovative world-class talent and a stable and accommodating regulatory environment. As with all of our facilities around the world, we chose Changhua County following a thorough and rigorous site selection process, taking many technical and other considerations into account, including location, infrastructure, workforce, reasonable business regulations and cost.",
                "image": "img/changhua-county.jpg",
                "img-source": "http://4.bp.blogspot.com/-TvTTr6o95zk/UqfVPWdRzBI/AAAAAAAAABs/p1Gz3WYacsA/s1600/CO6_0938.jpg",
                "type": "datacenter"
            }
        },
        {
            "type": "Feature",
            "geometry": {
                "type": "Point",
                "coordinates": [103.84540900000002, 1.314663]
            },
            "properties": {
                "city": "Singapore",
                "description": "Singapore offers an ideal combination of reliable infrastructure, a skilled workforce and a commitment to transparent and business friendly regulations. Singapore also has a vibrant Internet economy and is located in the center of one of the fastest growing Internet markets in the world, Southeast Asia, where millions of users are coming online every day for information and entertainment, new business opportunities and better ways to connect with friends and family, near and far.",
                "image": "img/singapore.jpg",
                "img-source": "http://2.bp.blogspot.com/-jF-AyxII7kA/UqfXj5R3EHI/AAAAAAAAACI/RsNXlIZNdMU/s1600/9299.jpg",
                "type": "datacenter"
            }
        }
    ]
}